{
    "attributes": {
        "su": true
    },
    "courseCode": "MA1102R",
    "courseCredit": "4",
    "description": "This is a course in single-variable calculus. We will introduce precise definitions of limit, continuity, the derivative and the Riemann integral. Students will be exposed to computational techniques and applications of differentiation and integration. This course concludes with an introduction to first order differential equations. Major topics: Functions, precise definitions of limit and continuity. Definition of the derivative, velocities and rates of change, Intermediate Value Theorem, differentiation formulas, chain rule, implicit differentiation, higher derivatives, the Mean Value Theorem, curve sketching. Definition of the Riemann integral, the Fundamental Theorem of Calculus. The elementary transcendental functions and their inverses. Techniques of integration: substitution, integration by parts, trigonometric substitutions, partial fractions. Computation of area, volume and arc length using definite integrals. First order differential equations: separable equations, homogeneous equations, integrating factors, linear first order equations, applications.",
    "faculty": "Science",
    "fulfillRequirements": [
        "EC3314",
        "DSC3214",
        "CS5240",
        "CS5241",
        "CS5249",
        "CS5343",
        "CS5332",
        "CS3244",
        "CS4243",
        "CS3242",
        "CS4347",
        "CS3218",
        "BT4240",
        "BT2101",
        "CM3201",
        "MA2104",
        "DSA2102",
        "MA2216",
        "MA2312",
        "MA2311",
        "MA2219",
        "MA2213",
        "MA2108S",
        "MA2108",
        "MA1506",
        "MA1104",
        "PC2230",
        "PC2134",
        "PC2132",
        "PC2131",
        "PC2130",
        "ST2334",
        "ST2131",
        "IT3011"
    ],
    "preclusion": "EE1401, EE1461, EG1401, EG1402, CE1402, MA1102, MA1312, MA1505, MA1505C, MA1507, MA1521, CEC students, COM students who matriculated on and after 2002 (including poly 2002 intake), FOE students",
    "title": "Calculus"
}
