{
    "courseCode": "UD5628",
    "courseCredit": "4",
    "description": "The module engages the contemporary issues of urban ecology and its articulation to design and development in urban settings. The new commitment of the co-habitation of nature and built environment has drawn attentions of the architects, urban designers and environmental professionals. The discourses of urban sustainability have to move away from social sufficiency, ecological efficiency to ecosystem compatibility by linking the forms and flows of urban, industrial and natural systems. The new challenges of urban ecological issue require design and environmental professionals to deal with how urban and environment spaces could be analyzed, designed, managed, evaluated, represented and changed for responding to the cutting-edge sustainable issues. Divided by two main categories, Spatial Typologies and Ecological Flows, the series of lecture covers the trends and issues of sustainable urban design and development. Following the introductory lecture based on planning and design history, the Part One Spatial Typologies includes global ecological effects of mega urban form, suburbanization and propositions of sustainable city, downtown urban design, waterfront revitalization and brown field redevelopment. The Part Two Ecological Flows covers the ecological design issues of landscape ecological flow, material and energy flow, water flow and informational flow. The sessions conclude with the discussion of representational dimension of urban and environmental design that is essential to the professional practices of ecologically sound urban and environmental design. By selecting one of the specific sustainable urban issues, students are required to work on a research project, which is to be presented as a team work during the semester and further developed as an individual term paper at the end of semester.",
    "faculty": "Design and Environment",
    "title": "Sustainable Urban Design and Development"
}
