{
    "attributes": {
        "su": true
    },
    "courseCode": "USE2317",
    "courseCredit": "4",
    "description": "Multiculturalism is a foundational pillar and defining feature in Singapore’s history and society. At once celebrated and contested, Singapore’s multiculturalism is imbued with various themes and meanings, and poses many important issues and challenges central to personal, group and national cultural identities as well as to political, economic and social life. How did it come to be a core principle in nation-building? What are state imperatives and social processes and state imperatives in its historical making and constant remaking? Why are race, language and religion its core constitutive elements and how have their saliency evolved over time? What are its main controversial features and areas of tensions, and how do these affect identities, social relations between individuals, groups and communities, and impact social cohesion, citizenship and belonging? How is it further impacted by massive immigration? Is its present official form still valid in light of immigration, changing demographics and competing claims of rights and responsibilities? What does multiculturalism mean in citizens’ memories of the past, experiences in their present everyday lives, and imaginings of the future? This module explores and discusses these central questions and significant dimensions, issues and problems in Singapore’s contested multiculturalism through a combination of lectures, seminars, on-site learning, research projects, class presentations and personal reflections. It also has a strong research component in which students discover and understand multiculturalism through research on selected topics using a variety of research methods, and relate their research and other observations to readings drawn from various disciplines of anthropology, sociology, history, economics, geography, heritage studies and memory studies.",
    "faculty": "University Scholars Programme",
    "preclusion": "Not applicable to USP modules.",
    "title": "Multiculturalism in Singapore and Its Contested Meanings"
}
