{
    "courseCode": "BMS5702B",
    "courseCredit": "4",
    "description": "This is a course in the design, management, and leadership of networks. It will examine a variety of business-related networks. These include entrepreneurial networks of resource providers and alliance partners; networks of communication and coordination within established organizations; supply chain and marketing channel networks; informal networks in and outside organizations that confer influence and advance careers; cross-border networks for doing business globally. Managing in the contemporary global economy is much more about managing networks than hierarchical organizations through fixed chains of command. Both within organizations and between them, the paths to productivity, innovation, and success lie in astute networking. Network management and leadership demand different capabilities from those necessary to run a single firm or division within it. Communication, persuasion, collaboration, negotiation, emotional intelligence, flexibility, trust-building, reciprocity, and responsiveness are all essential. However, good network management requires more than 'soft' or interpersonal skills. Given the complexity of business networks today, familiarity with the technical tools of network analysis can be very helpful as well. A highly technical science of networks now exists. Managers should learn how to use that science in analyzing and engineering their networks for superior performance. We will approach the problem of managing networks from two perspectives, 'up' and 'down.' 'Up' refers to your vantage point as an individual actor, crafting your personal network, positioning yourself within it, and leveraging it for professional advantage and success. 'Down' is your vantage point as an executive charged with responsibility for the functioning and success of the network as a whole; for example, within a division or functional area or a supply chain or distribution system.",
    "faculty": "NUS Business School",
    "title": "Managing Business Networks"
}
