{
    "courseCode": "SG5003",
    "courseCredit": "4",
    "description": "SG5003-1 Software Quality Engineering The objective of this course is to provide an introduction to Software quality engineering It begins by describing features of modern quality thinking, including Deming?s 14 Points It then gives an overview of CMM and compares CMM and ISO9001; The course covers the following topics: Planning for Quality; Software Quality Assurance Activities in the Software Life Cycle; Quality Factors; Quality Metrics; Quality Roles and Responsibilities, Quality Policies and Quality audits. This module is compulsory for all SE students. SG5003-2 Software Quality Management Systems The objective of this course is to provide an introduction to SQMS and ISO9001:2000. It describes how to conduct a pre-assessment. It then focuses on developing an SQMS. In particular it describes Quality manual development, the quality system framework, life cycle activities, supporting activities,. There is a quality manual development assignment, quality audit assignments and pre-assessment assignments. This module is compulsory for all SE students. SG5003-3 Peer Reviews The objective of this course is to teach how to perform Peer Reviews. It provides an overview of Peer reviews, and describes Rules, Source Documents and Kin; the Software Inspection Process, and Inspection roles and responsibilities; Software Inspection Defect classifications; Defect Logging, Peer Review Follow-up. There is a peer review assignment. This module is compulsory for all SE students. SG5003-4 Software Testing The objective of this course is to teach how to effectively test software Topics covered in the course include; Purpose of Testing; Functional and Quality Testing; Testing Techniques; Tool Support for Testing; Success Criteria; Defect Tracking and Defect Cause Analysis. This module is compulsory for all SE students.",
    "faculty": "Institute of Systems Science",
    "title": "Software Quality Management"
}
