{
    "courseCode": "LL5297",
    "courseCredit": "4",
    "description": "Modern corporations draw funding to finance their consumption and investment needs from a variety of sources on the basis of extensive cost- benefit considerations. These include a multitude of factors, such as legal considerations, the quantity of funding required and cost of capital depending on its source, and impact on shareholders and management etc. Corporations may also obtain finance by either levering existing assets or resorting to unsecured bank lending or bond issues. For the biggest corporations the most important source of finance tends to be the capital markets. These normally comprise the debt and equity markets through which public companies can offer securities to investors or to transfer the control of the company to new owners in the context of an agreed takeover, a hostile take-over bid, or of a private equity transaction. This course aims to develop a critical understanding of the subject matter through the combined study of finance theory, corporate law, capital market regulation and the corporate market dynamics, with a special focus on the different stakeholders involved in corporate finance. The module will focus on critical corporate finance issues such as: the use of debt and equity; why merge or acquire a business; core considerations of the process; purchase sale agreements and contractual governance; the role of the board of directors in an acquisition/financing transaction; the permissibility and regulation of takeover defenses in the UK, the US and the EU. It will also discuss cross-border IPOS, the problem of market abuse, theory and practice of corporate takeovers and their regulation, and issues pertinent to private equity transactions, as well practical issues relating to structuring corporate acquisition deals and attendant legal documentation. NB: While there is inevitably reference to scores of economic concepts and some finance readings the course is specifically addressed to law students it is non-mathematical.",
    "faculty": "Law",
    "preclusion": "LL4297V/LL5297V/LL6297V Practice of Corporate Finance and the Law",
    "title": "Practice of Corporate Finance and the Law"
}
