{
    "courseCode": "LL5298",
    "courseCredit": "4",
    "description": "This is the foundation course in international finance. It is meant for all who want to gain a better understanding of what is happening and concerns primarily (a) the way money is recycled through the banking system or the capital market, (b) the products and conduct of the banking, securities and investment industry in this recycling activity, (c) the risks that are taken in the financial services industry (primarily by commercial and investment banks in their different functions) and the tools of risk management, (d) the operation of the financial markets and their infrastructure, (e) the type of regulation of commercial banks and of the intermediaries and issuers in the capital markets, and (f) the objectives, role, shape and effectiveness of this regulation. In this connection, the course will also deal with the smooth operation of payment systems. Financial risk and its management is an important theme and the major concern in the course. What can commercial or investment banks and financial regulation achieve in this regard, how is risk management structured, and what academic or other (political) models are used in this connection, how effective are they, e.g. in the capital adequacy and liquidity requirements, and what can or must governments and/or central banks or other regulators do when all fails and financial crises occur? From a legal point of view, an important aspect is the strong public policy undercurrents in the applicable law. That is obvious in regulation but may also impact on private law. Another important issuer is that the law applicable to financial products and their regulation is ever more transnationalised and expressed at the international level, especially in terms of transactional and payment finality, financial stability, and even banking resolution facilities or international safety nets. In these circumstances, choice of national laws in the older private international law approach often mean little and it will be discussed how they may fall seriously short especially in in matters of regulatory oversight and bankruptcy situations.",
    "faculty": "Law",
    "preclusion": "LL4298V/LL5298V/LL6298V International Finance",
    "title": "International Finance"
}
