{
    "courseCode": "LL6034V",
    "courseCredit": "5",
    "description": "This course will examine the global regime governing the international regulation of commercial shipping. It will examine the relationship between the legal framework established in the 1982 UN Convention on the Law of the Sea and the work of the International Maritime Organization (IMO), the UN specialized agency responsible for the safety and security of international shipping and the prevention of pollution from ships. The course will focus on selected global conventions administered by the IMO, including those governing safety of life at sea (SOLAS), the prevention of pollution from ships (MARPOL) and the training, certification and watchkeeping for seafarers (STCW). It will also examine the liability and compensation schemes that have been developed for pollution damage caused by the carriage of oil and noxious substances by ships, as well as the conventions designed to ensure that States undertake contingency planning in order to combat spills of oil and other noxious and hazardous substances in their waters. In addition, the course will examine the schemes that have been developed to enhance the security of ships and ports in light of the threat of maritime terrorism. It will also examine the role of the IMO in the prevention of pollution of the marine environment from dumping waste at sea and from seabed activities subject to national jurisdiction. One of the themes of the course will be to consider how the IMO is responding to increased concern about the protection and preservation of the marine environment, including threats such as invasive species and climate change. Another theme will be to consider how the responsibility to enforce IMO Conventions is divided between flag States, coastal States, port States and the IMO. This course will be useful to persons who intend to practice shipping law or work in the private or public maritime sector.",
    "faculty": "Law",
    "preclusion": "Students who are taking or have taken LL6034.",
    "title": "International Regulation of Shipping"
}
