{
  "students" : [ {
    "name" : "Paul",
    "credits" : "20",
    "prevMods" : "CS2202, CS5505",
    "matricId" : "A00192034Z",
    "tagged" : [ "C123456", "C002923" ]
  }, {
    "name" : "Alex",
    "credits" : "20",
    "prevMods" : "CS2202, CS1111",
    "matricId" : "A220193040F",
    "tagged" : [ "C123456", "C002923" ]
  }, {
    "name" : "Alex Yeoh",
    "credits" : "20",
    "prevMods" : "CS2030, CS4040",
    "matricId" : "A0180000R",
    "tagged" : [ "friends" ]
  }, {
    "name" : "Bernice Yu",
    "credits" : "20",
    "prevMods" : "CS2030, CS4040",
    "matricId" : "A01455353y",
    "tagged" : [ "colleagues", "friends" ]
  }, {
    "name" : "Charlotte Oliveiro",
    "credits" : "20",
    "prevMods" : "CS2030, CS4040",
    "matricId" : "A0199239U",
    "tagged" : [ "neighbours" ]
  }, {
    "name" : "David Li",
    "credits" : "20",
    "prevMods" : "CS2030, CS4040",
    "matricId" : "A01423223T",
    "tagged" : [ "family" ]
  }, {
    "name" : "Irfan Ibrahim",
    "credits" : "20",
    "prevMods" : "CS2030, CS4040",
    "matricId" : "A12039123S",
    "tagged" : [ "classmates" ]
  }, {
    "name" : "Roy Balakrishnan",
    "credits" : "20",
    "prevMods" : "CS2030, CS4202",
    "matricId" : "A015923848U",
    "tagged" : [ "colleagues" ]
  } ],
  "modules" : [ {
    "quota" : "100",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS1010",
    "moduleName" : "Programming Methodology",
    "moduleDescription" : "This module introduces the fundamental concepts of problem solving by computing and programming using an imperative programming language. It is the first and foremost introductory course to computing. Topics covered include computational thinking and computational problem solving, designing and specifying an algorithm, basic problem formulation and problem solving approaches, program development, coding, testing and debugging, fundamental programming constructs (variables, types, expressions, assignments, functions, control structures, etc.), fundamental data structures (arrays, strings, composite data types), basic sorting, and recursion.",
    "lecturerName" : "Tung Kum Hoe Anthony",
    "timeSlot" : "1,2,45,46,47"
  }, {
    "quota" : "120",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS1231",
    "moduleName" : "Discrete Structures",
    "moduleDescription" : "This module introduces mathematical tools required in the study of computer science. Topics include: (1) Logic and proof techniques: propositions, conditionals, quantifications. (2) Relations and Functions: Equivalence relations and partitions. Partially ordered sets. Well-Ordering Principle. Function equality. Boolean/identity/inverse functions. Bijection. (3) Mathematical formulation of data models (linear model, trees, graphs). (4) Counting and Combinatoric: Pigeonhole Principle. Inclusion-Exclusion Principle. Number of relations on a set, number of injections from one finite set to another, Diagonalisation proof: An infinite countable set has an uncountable power set; Algorithmic proof: An infinite set has a countably infinite subset. Subsets of countable sets are countable.",
    "lecturerName" : "Terence Sim",
    "timeSlot" : "1,2,45,46,47"
  }, {
    "quota" : "120",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS1020",
    "moduleName" : "Data Structures and Algorithms Is",
    "moduleDescription" : "This module is the second part of a three-part series on introductory programming and problem solving by computing. It continues the introduction that begins in CS1010, and emphasises objectoriented programming with application to simple data structures. Topics include object-oriented problem modeling with objects, classes and methods, object-oriented problem formulation and solving, data structure implementation strageties, abstraction and encapsulation of data structures, object-oriented programming constructs, APIs and class libraries, exception handling, lists, linked lists, stacks, queues, hash tables and their algorithmic design, sorting and searching methods, recursive algorithms, and Big-O notation. This module is appropriate for SoC and FoS students.",
    "lecturerName" : "Tan Sun Teck",
    "timeSlot" : "21,20,55,56,57"
  }, {
    "quota" : "420",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2309",
    "moduleName" : "CS Research Methodology",
    "moduleDescription" : "This module is for research students.",
    "lecturerName" : "Wynne Hsu",
    "timeSlot" : "1,2,45,46,47"
  }, {
    "quota" : "840",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2106",
    "moduleName" : "Introduction to Operating Systems",
    "moduleDescription" : "This module introduces the basic concepts in operating systems and links it with contemporary operating systems (eg. Unix/Linux and Windows). It focuses on OS structuring and architecture, processes, memory management, concurrency and file systems. Topics include kernel architecture, system calls, interrupts, models of processes, process abstraction and services, scheduling, review of physical memory and memory management hardware, kernel memory management, virtual memory and paging, caches, working set, deadlock, mutual exclusion, synchronisation mechanisms, data and metadata in file systems, directories and structure, file system abstraction and operations, OS protection mechanisms, and user authentication.",
    "lecturerName" : "ANG RAY YAN",
    "timeSlot" : "1,2,45,46,47"
  }, {
    "quota" : "240",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2040",
    "moduleName" : "Data Structures and Algorithms",
    "moduleDescription" : "This module introduces students to the design and implementation of fundamental data structures and algorithms. The module covers basic data structures (linked lists, stacks, queues, hash tables, binary heaps, trees, and graphs), searching and sorting algorithms, and basic analysis of algorithms.",
    "lecturerName" : "Chong Ket Fah",
    "timeSlot" : "40,41,10,11,12"
  }, {
    "quota" : "120",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2220",
    "moduleName" : "Introduction to Computational Biology",
    "moduleDescription" : "This course aims to develop flexible and logical problem solving skills, understanding of main bioinformatics problems, and appreciation of main techniques and approaches to bioinformatics. Through case studies and hands-on exercises, the student will (i) master the basic tools and approaches for analysis of DNA sequences, protein sequences, gene expression profiles, etc. (ii) understand important problems and applications of computational biology, including identifying functional features in DNA and protein sequences, predicting protein function, and deriving diagnostic models from gene expression profiles, (iii) be confident to propose new solutions to both existing and emerging problems in computational biology.",
    "lecturerName" : "Limsoon Wong",
    "timeSlot" : "30,31,32,33"
  }, {
    "quota" : "666",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2100",
    "moduleName" : "Computer Organisation",
    "moduleDescription" : "The objective of this module is to familiarise students with the fundamentals of computing devices. Through this module students will understand the basics of data representation, and how the various parts of a computer work, separately and with each other. This allows students to understand the issues in computing devices, and how these issues affect the implementation of solutions. Topics covered include data representation systems, combinational and sequential circuit design techniques, assembly language, processor execution cycles, pipelining, memory hierarchy and input/output systems.",
    "lecturerName" : "LI ZHAOYING",
    "timeSlot" : "32,33,12,13"
  }, {
    "quota" : "720",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2105",
    "moduleName" : "Introduction to Computer Networks",
    "moduleDescription" : "This module aims to provide a broad introduction to computer networks and network application programming. It covers the main concepts, the fundamental principles, and the high-level workings of important protocols in each of the Internet protocol layer. Topics include the Web and Web applications, DNS services, socket programming, reliable protocols, transport and network layer protocols, secure communication, LAN, and data communication. Practical assignments and handson exercises expose students to network application programming and various networking tools and utilities.",
    "lecturerName" : "Zhou Lifeng",
    "timeSlot" : "1,2,45,46,47"
  }, {
    "quota" : "120",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2030",
    "moduleName" : "Programming Methodology II",
    "moduleDescription" : "This module is a follow up to CS1010. It explores two modern programming paradigms, object-oriented programming and functional programming. Through a series of integrated assignments, students will learn to develop medium-scale software programs in the order of thousands of lines of code and tens of classes using objectoriented design principles and advanced programming constructs available in the two paradigms. Topics include objects and classes, composition, association, inheritance, interface, polymorphism, abstract classes, dynamic binding, lambda expression, effect-free programming, first class functions, closures, continuations, monad, etc.",
    "lecturerName" : "LEE LIAK GHEE",
    "timeSlot" : "1,2,45,46,47"
  }, {
    "quota" : "111",
    "tagged" : [ "A6185284H", "A5802229H", "A6614133H", "A5524592H", "A1748370H" ],
    "moduleCode" : "CS2101",
    "moduleName" : "Effective Communication for Computing Professionals",
    "moduleDescription" : "This module aims to equip students with the skills needed to communicate technical information to technical and nontechnical audiences, and to create comprehensible software documentation. A student-centric approach will be adopted to encourage independent and collaborative learning while engaging students in team-based projects. Students will learn interpersonal and intercultural communication skills as well as hone their oral and written communication skills. Assessment modes include a variety of oral and written communication tasks such as reports, software guides, oral presentations, software demonstrations and project blogs.",
    "lecturerName" : "Shirley James",
    "timeSlot" : "29,30,31,54,55"
  } ],
  "appeals" : [ {
    "appealId" : "C000000",
    "appealType" : "Increase workload",
    "studentId" : "A0180000",
    "academicYear" : "AY2019",
    "studentWorkload" : 24,
    "appealDescription" : "I want to increase my workload so I can graduate on time",
    "previousModule" : "",
    "newModule" : "",
    "moduleToAdd" : "",
    "moduleToDrop" : "",
    "resolved" : false,
    "result" : null,
    "remark" : ""
  }, {
    "appealId" : "C000001",
    "appealType" : "Drop module",
    "studentId" : "A0180001",
    "academicYear" : "AY2019",
    "studentWorkload" : 28,
    "appealDescription" : "I don't think I can cope with the workload",
    "previousModule" : "",
    "newModule" : "",
    "moduleToAdd" : "",
    "moduleToDrop" : "",
    "resolved" : false,
    "result" : null,
    "remark" : ""
  }, {
    "appealId" : "C000002",
    "appealType" : "Drop module",
    "studentId" : "A0180002",
    "academicYear" : "AY2019",
    "studentWorkload" : 28,
    "appealDescription" : "I cannot cope with the workload",
    "previousModule" : "",
    "newModule" : "",
    "moduleToAdd" : "",
    "moduleToDrop" : "",
    "resolved" : false,
    "result" : null,
    "remark" : ""
  }, {
    "appealId" : "C000003",
    "appealType" : "Add module",
    "studentId" : "A0180003",
    "academicYear" : "AY2020",
    "studentWorkload" : 20,
    "appealDescription" : "I want to take another module",
    "previousModule" : "",
    "newModule" : "",
    "moduleToAdd" : "",
    "moduleToDrop" : "",
    "resolved" : false,
    "result" : null,
    "remark" : ""
  }, {
    "appealId" : "C000004",
    "appealType" : "Increase workload",
    "studentId" : "A0180004",
    "academicYear" : "AY2019",
    "studentWorkload" : 20,
    "appealDescription" : "I want to clear my UEs",
    "previousModule" : "",
    "newModule" : "",
    "moduleToAdd" : "",
    "moduleToDrop" : "",
    "resolved" : false,
    "result" : null,
    "remark" : ""
  }, {
    "appealId" : "C000005",
    "appealType" : "Add module",
    "studentId" : "A0180005",
    "academicYear" : "AY2019",
    "studentWorkload" : 20,
    "appealDescription" : "I want to graduate earlier",
    "previousModule" : "",
    "newModule" : "",
    "moduleToAdd" : "",
    "moduleToDrop" : "",
    "resolved" : false,
    "result" : null,
    "remark" : ""
  }, {
    "appealId" : "C000006",
    "appealType" : "Add module",
    "studentId" : "A0180006",
    "academicYear" : "AY2019",
    "studentWorkload" : 20,
    "appealDescription" : "I wish to take this module to clear my prerequisite",
    "previousModule" : "",
    "newModule" : "",
    "moduleToAdd" : "",
    "moduleToDrop" : "",
    "resolved" : false,
    "result" : null,
    "remark" : ""
  } ]
}