{
    "courseCode": "YSS4234",
    "courseCredit": "5",
    "description": "The course offers an advanced-level, in-depth understanding urban heritage, both as it manifests in the built environment but also in intangible social and cultural phenomena. The course begins by defining what heritage is in urban contexts, and inquiring into the special pressures urbanisation places on 'inherited' built forms and ways of life. The module will draw on historical developments in urban heritage politics and planning in both North America and Europe, but the key emphasis will be on in-depth understanding of the emergence of urban heritage landscapes in Asian cities. The course offers an advanced-level, in-depth understanding urban heritage, both as it manifests in the built environment but also in intangible social and cultural phenomena. The course begins by defining what heritage is in urban contexts, and inquiring into the special pressures urbanisation places on 'inherited' built forms and ways of life. The course will tackle the following topics: • the contested politics of whose past becomes heritage, and why? • the relationship between urban heritage places, memory and identity • civil society interests and political activism • scholarly architectural debates about how to preserve the past: restoration, preservation, conservation, renewal etc (Ruskin et al) • state-based processes of recognition and preservation • international frameworks for conservation • The tensions between heritage, tourism and authenticity The module will draw on historical developments in urban heritage politics and planning in both North America and Europe, but the key emphasis will be on in-depth understanding of the emergence of urban heritage landscapes in Asian cities.",
    "faculty": "Yale-NUS College",
    "prereqTree": {
        "or": [
            "YSS2220",
            "YHU3276"
        ]
    },
    "title": "Urban Heritage: Place, Memory, Identity"
}
