{
    "attributes": {
        "su": true
    },
    "courseCode": "UNL2201",
    "courseCredit": "4",
    "description": "As an inquiry-tier module, students will be brought through a general framework for thinking about these issues lensed from philosophy mathematics and physics. Specifically, - The philosophical strand will expose students to some of the early conceptions of space, time and matter. Principally ideas of Descartes and Leibniz with emphasis on Kant’s concept of space and time. The mathematization of science in the 17th Century - from Descartes use of coordinate geometry to Galileo’s Principle of Inertia and the mathematics of motion will serve to showcase how the early concepts took shape. - The mathematical strand will serve to showcase how Euclid’s axiomatic approach to geometry formed the basis of subsequent generalizations that led to the characterization of space and time. Here students will be introduced to structures such as topological spaces, manifolds and Riemannian spaces that form the basis of the space-time fabric. - The physical strand will touch on the notion of physical symmetries and its relation to geometry. In particular, Galilean and Special relativity will serve to elucidate how the motion of particles in the space-time fabric reveals its geometrical structure. This will culminate in Einstein’s Equivalence Principle and its implications leading up to the General theory of Relativity. The aim here is to provide a coherent exposition of how the three disciplines come together in providing insights into the nature of space, time and matter. The questions raised will force students to examine and reflect on the extent to which our commonsensical views of the physical space accurately describes the way nature really is; and to what degree this view is tenable on the basis of detailed quantitative reasons and empirical evidence. Hopefully, through this analysis, students will appreciate the subtle interplay between the realm of ideas and mental constructs and that of experiments and scientific facts.",
    "faculty": "University Scholars Programme",
    "title": "Space, Time & Matter: The Shape and Size of the Cosmos"
}
